"""
כתבו פונקציה שנקראת filter_teens המוגדרת כך:

def filter_teens(a, b, c):
הפונקציה מקבלת שלושה ערכים המייצגים גילים: a, b, c ומחזירה את סכומם.

הנחיות
אם הפונקציה נקראת ללא פרמטרים, ערך ברירת המחדל של כל גיל הוא 13.
אם אחד מהערכים מייצג גיל של בני נוער בין 13 ל-19 (כולל אותם) אך למעט הגילים 15 ו-16 - תקנו את ערכו בעזרת הפונקציה המתוארת להלן, כך שיחושב כ-0.
כתבו פונקציית עזר fix_age המוגדרת כך:
def fix_age(age):
הפונקציה מקבלת מספר שמייצג גיל ומחזירה אותו מתוקן על פי החוקים לעיל. קראו לפונקציה fix_age מתוך הפונקציה filter_teens כך שלא תחזרו על הקוד של תיקון הגיל שלוש פעמים.
"""


def filter_teens(a = 13, b = 13, c = 13):
    return fix_age(a) + fix_age(b) + fix_age(c)


def fix_age(age):
    if age == 15 or age == 16:
        return age

    if 13 <= age <= 19:
        return 0

    return age

