#כתבו קטע קוד על פי הסעיפים הבאים:

#הגדירו את המשתנים:
#משתנה קבוע שנקרא HANGMAN_ASCII_ART. המשתנה יצביע על משפט הפתיחה והמחרוזת אותה הדפסתם כחלק מדף הפתיחה המעוצב שיצרתם.
#משתנה קבוע שנקרא MAX_TRIES. הערך של המשתנה מייצג את מספר הניסיונות הכושלים המירבי והוא 6.
#הדפיסו את מסך הפתיחה (בדומה לזה שהדפסתם במשימה המתגלגלת בסוף היחידה הקודמת) בפקודת הדפסה אחת. הפעם עשו זאת באמצעות שימוש במשתנים שהגדרתם.

HANGMAN_ASCII_ART = """Welcome to the game Hangman
  _    _                                         
 | |  | |                                        
 | |__| | __ _ _ __   __ _ _ __ ___   __ _ _ __  
 |  __  |/ _` | '_ \ / _` | '_ ` _ \ / _` | '_ \ 
 | |  | | (_| | | | | (_| | | | | | | (_| | | | |
 |_|  |_|\__,_|_| |_|\__, |_| |_| |_|\__,_|_| |_|
                      __/ |                      
                     |___/
"""

MAX_TRIES = "6"

print(HANGMAN_ASCII_ART + "\n"+ MAX_TRIES)