#בתרגיל זה תתחילו לפתח את המשחק בעיצוב "מסך פתיחה" שיופיע לשחקן שמתחיל לשחק. עליכם ליצור "מסך פתיחה" מעוצב למשחק.
#
#מסך הפתיחה יהיה בנוי בהתאמה לסעיפים הבאים:
#
#הדפיסו למסך את המשפט Welcome to the game Hangman.
#הדפיסו למסך את רצף התווים היוצרים את הכיתוב: "Hangman" ונמצאים בקישור הזה.
#הדפיסו מספר שלם המציין כמה ניסיונות ניחוש (כושלים) מותרים לשחקן במשחק. על המספר להיות אקראי ובטווח שבין 5 ל-10 (כולל).


import random

print("Welcome to the game Hangman")

print("""
  _    _                                         
 | |  | |                                        
 | |__| | __ _ _ __   __ _ _ __ ___   __ _ _ __  
 |  __  |/ _` | '_ \ / _` | '_ ` _ \ / _` | '_ \ 
 | |  | | (_| | | | | (_| | | | | | | (_| | | | |
 |_|  |_|\__,_|_| |_|\__, |_| |_| |_|\__,_|_| |_|
                      __/ |                      
                     |___/
""")

print(random.randint(5,10))